[
    {
        "title" : "What's an essential step in effective problem-solving?",
        "options" : ["Jumping to conclusions quickly to save time",
        "Ignoring alternative perspectives and solutions",
        "Gathering relevant information and analyzing the situation",
        "Relying solely on intuition without considering facts"],
        "answer" : "Gathering relevant information and analyzing the situation"
    },
    {
        "title" : "How should you approach a disagreement with a coworker?",
        "options" : ["Avoid them and refuse to engage in any discussions",
        "Confront them aggressively and demand they accept your viewpoint",
        "Seek to understand their perspective, communicate calmly, and find a compromise",
        "Complain to your supervisor without discussing the issue with your coworker"],
        "answer" : "Seek to understand their perspective, communicate calmly, and find a compromise"
    },
    {
        "title" : "There is a room with a door (closed) and three light bulbs inside the room. Outside the room, there are three switches, connected to the bulbs. Find the minimum number of times that you open the door to identify each switch with respect to its bulb.",
        "options" : ["1","2","3","4"],
        "answer" : "1"
    },
    {
        "title" : "How many zeroes are required to make the number 120 where you should make use of only the digit '0' any number of times followed by any mathematical operation excluding all real numbers?",
        "options" : ["12","5","10","6"],
        "answer" : "5"
    },
    {
        "title" : "What's a characteristic of an effective leader?",
        "options" : ["Micromanaging every task and decision" , "Taking credit for team successes and blaming them for failures",
        "Providing guidance, empowering team members, and leading by example",
        "Maintaining a distant and unapproachable demeanor"],
        "answer" : "Providing guidance, empowering team members, and leading by example"
    }
    
]